"""
Не все элементы важны. Вам нужно удалить из список все элементы до указаного.

example

На примере мы имеем список [1, 2, 3, 4, 5] где нужно было удалить все элементы до 3 - 1 и 2 соответственно.

Есть два ньюанса: (1) если в списке нет элемента до которого нужно удалить остальные элементы, то список не должен измениться. (2) если list пустой, то он должен остаться пустым.

Входные данные: Список и элемент до которого нужно удалить другие элементы.

Выходные данные: Набор значений (кортеж, список, итератор ...).

Пример:
"""

from typing import Iterable


def remove_all_before(items: list, border: int) -> Iterable:
    try:
        if border in items:
            idx = items.index(border)
            return items[idx:]
        else:
            return items
    except ValueError:
        return items
