"""
Ваша цель сейчас — создать функцию, которая принимает на вход кортеж и возвращает кортеж из 3 элементов: первого, третьего и второго с конца элементов заданного массива.

пример

Важно отметить, что вам нужно использовать индекс для извлечения элементов из массива. Обратите внимание, нумерация индексов начинается с 0, не с 1. Это означает, что если вы хотите получить первый элемент из массива elements , вам нужен elements[0] , а если второй — elements[1] .

Входные данные: Кортеж длиной не менее 3 элементов.

Выходные данные: Кортеж.

Пример:
"""


def easy_unpack(elements: tuple) -> tuple:
    a = []
    a.append(elements[0])
    a.append(elements[2])
    a.append(elements[-2])
    return tuple(a)
